SChristophS/GrowBox_NG/growbox-controller/STM32f4_GCU/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stm32f4xx_hal.h"
#include <stdio.h>
#include <string.h>
#include <stdint.h>
#include <stdbool.h>
#include "socket.h"
#include "stdlib.h"
#include "math.h"

/* other */
#include "globals.h"

#include "controller_state.h"
#include "state_manager.h"
#include "uart_redirect.h"
#include "wizchip_init.h"
#include "logger.h"
#include "helper_websocket.h"

/* Tasks */
#include "task_alive.h"
#include "task_hardware.h"
#include "task_light_controller.h"
#include "task_network.h"
#include "task_sensor.h"
#include "task_water_controller.h"



/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
typedef StaticTask_t osStaticThreadDef_t;
typedef StaticQueue_t osStaticMessageQDef_t;
typedef StaticSemaphore_t osStaticMutexDef_t;
typedef StaticEventGroup_t osStaticEventGroupDef_t;
/* USER CODE BEGIN PTD */



/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */


/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
I2C_HandleTypeDef hi2c2;

SPI_HandleTypeDef hspi1;
SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim6;
TIM_HandleTypeDef htim10;

UART_HandleTypeDef huart2;

/* Definitions for AliveTask */
osThreadId_t AliveTaskHandle;
uint32_t AliveTaskBuffer[ 512 ];
osStaticThreadDef_t AliveTaskControlBlock;
const osThreadAttr_t AliveTask_attributes = {
  .name = "AliveTask",
  .cb_mem = &AliveTaskControlBlock,
  .cb_size = sizeof(AliveTaskControlBlock),
  .stack_mem = &AliveTaskBuffer[0],
  .stack_size = sizeof(AliveTaskBuffer),
  .priority = (osPriority_t) osPriorityNormal,
};
/* Definitions for NetworkTask */
osThreadId_t NetworkTaskHandle;
const osThreadAttr_t NetworkTask_attributes = {
  .name = "NetworkTask",
  .stack_size = 3000 * 4,
  .priority = (osPriority_t) osPriorityAboveNormal,
};
/* Definitions for WaterController */
osThreadId_t WaterControllerHandle;
uint32_t WaterControllerBuffer[ 1024 ];
osStaticThreadDef_t WaterControllerControlBlock;
const osThreadAttr_t WaterController_attributes = {
  .name = "WaterController",
  .cb_mem = &WaterControllerControlBlock,
  .cb_size = sizeof(WaterControllerControlBlock),
  .stack_mem = &WaterControllerBuffer[0],
  .stack_size = sizeof(WaterControllerBuffer),
  .priority = (osPriority_t) osPriorityNormal1,
};
/* Definitions for LightTask */
osThreadId_t LightTaskHandle;
uint32_t LightTaskBuffer[ 1024 ];
osStaticThreadDef_t LightTaskControlBlock;
const osThreadAttr_t LightTask_attributes = {
  .name = "LightTask",
  .cb_mem = &LightTaskControlBlock,
  .cb_size = sizeof(LightTaskControlBlock),
  .stack_mem = &LightTaskBuffer[0],
  .stack_size = sizeof(LightTaskBuffer),
  .priority = (osPriority_t) osPriorityNormal2,
};
/* Definitions for SensorTask */
osThreadId_t SensorTaskHandle;
uint32_t SensorTaskBuffer[ 512 ];
osStaticThreadDef_t SensorTaskControlBlock;
const osThreadAttr_t SensorTask_attributes = {
  .name = "SensorTask",
  .cb_mem = &SensorTaskControlBlock,
  .cb_size = sizeof(SensorTaskControlBlock),
  .stack_mem = &SensorTaskBuffer[0],
  .stack_size = sizeof(SensorTaskBuffer),
  .priority = (osPriority_t) osPriorityLow,
};
/* Definitions for HardwareTask */
osThreadId_t HardwareTaskHandle;
uint32_t HardwareTaskBuffer[ 512 ];
osStaticThreadDef_t HardwareTaskControlBlock;
const osThreadAttr_t HardwareTask_attributes = {
  .name = "HardwareTask",
  .cb_mem = &HardwareTaskControlBlock,
  .cb_size = sizeof(HardwareTaskControlBlock),
  .stack_mem = &HardwareTaskBuffer[0],
  .stack_size = sizeof(HardwareTaskBuffer),
  .priority = (osPriority_t) osPriorityAboveNormal,
};
/* Definitions for xWaterControllerQueue */
osMessageQueueId_t xWaterControllerQueueHandle;
uint8_t xWaterControllerQueueBuffer[ 1 * sizeof( uint8_t ) ];
osStaticMessageQDef_t xWaterControllerQueueControlBlock;
const osMessageQueueAttr_t xWaterControllerQueue_attributes = {
  .name = "xWaterControllerQueue",
  .cb_mem = &xWaterControllerQueueControlBlock,
  .cb_size = sizeof(xWaterControllerQueueControlBlock),
  .mq_mem = &xWaterControllerQueueBuffer,
  .mq_size = sizeof(xWaterControllerQueueBuffer)
};
/* Definitions for xLightControllerQueue */
osMessageQueueId_t xLightControllerQueueHandle;
uint8_t xLightControllerQueueBuffer[ 1 * sizeof( uint8_t ) ];
osStaticMessageQDef_t xLightControllerQueueControlBlock;
const osMessageQueueAttr_t xLightControllerQueue_attributes = {
  .name = "xLightControllerQueue",
  .cb_mem = &xLightControllerQueueControlBlock,
  .cb_size = sizeof(xLightControllerQueueControlBlock),
  .mq_mem = &xLightControllerQueueBuffer,
  .mq_size = sizeof(xLightControllerQueueBuffer)
};




/* Definitions for xWebSocketQueue */
#define MESSAGE_POINTER_SIZE sizeof(MessageForWebSocket*)


/* Definitions for xWebSocketQueue */
osMessageQueueId_t xWebSocketQueueHandle;
MessageForWebSocket* xWebSocketQueueBuffer[ 3 ]; // Array von Pointern
osStaticMessageQDef_t xWebSocketQueueControlBlock;
const osMessageQueueAttr_t xWebSocketQueue_attributes = {
  .name = "xWebSocketQueue",
  .cb_mem = &xWebSocketQueueControlBlock,
  .cb_size = sizeof(xWebSocketQueueControlBlock),
  .mq_mem = &xWebSocketQueueBuffer,
  .mq_size = sizeof(xWebSocketQueueBuffer)
};






/* Definitions for xHardwareQueue */
osMessageQueueId_t xHardwareQueueHandle;
uint8_t xHardwareQueueBuffer[ 2 * 8 ];
osStaticMessageQDef_t xHardwareQueueControlBlock;
const osMessageQueueAttr_t xHardwareQueue_attributes = {
  .name = "xHardwareQueue",
  .cb_mem = &xHardwareQueueControlBlock,
  .cb_size = sizeof(xHardwareQueueControlBlock),
  .mq_mem = &xHardwareQueueBuffer,
  .mq_size = sizeof(xHardwareQueueBuffer)
};
