SChristophS/GrowBox_NG/growbox-controller/STM32f4_GCU/Core/Src/main.c
/* Definitions for xWaterCommandQueue */
osMessageQueueId_t xWaterCommandQueueHandle;
uint8_t xWaterCommandQueueBuffer[ 3 * 4 ];
osStaticMessageQDef_t xWaterCommandQueueControlBlock;
const osMessageQueueAttr_t xWaterCommandQueue_attributes = {
  .name = "xWaterCommandQueue",
  .cb_mem = &xWaterCommandQueueControlBlock,
  .cb_size = sizeof(xWaterCommandQueueControlBlock),
  .mq_mem = &xWaterCommandQueueBuffer,
  .mq_size = sizeof(xWaterCommandQueueBuffer)
};
/* Definitions for xLightCommandQueue */
osMessageQueueId_t xLightCommandQueueHandle;
uint8_t xLightCommandQueueBuffer[ 3 * 4 ];
osStaticMessageQDef_t xLightCommandQueueControlBlock;
const osMessageQueueAttr_t xLightCommandQueue_attributes = {
  .name = "xLightCommandQueue",
  .cb_mem = &xLightCommandQueueControlBlock,
  .cb_size = sizeof(xLightCommandQueueControlBlock),
  .mq_mem = &xLightCommandQueueBuffer,
  .mq_size = sizeof(xLightCommandQueueBuffer)
};
/* Definitions for gControllerStateMutex */
osMutexId_t gControllerStateMutexHandle;
osStaticMutexDef_t gControllerStateMutexControlBlock;
const osMutexAttr_t gControllerStateMutex_attributes = {
  .name = "gControllerStateMutex",
  .cb_mem = &gControllerStateMutexControlBlock,
  .cb_size = sizeof(gControllerStateMutexControlBlock),
};
/* Definitions for gGrowCycleConfigMutex */
osMutexId_t gGrowCycleConfigMutexHandle;
osStaticMutexDef_t gGrowCycleConfigMutexControlBlock;
const osMutexAttr_t gGrowCycleConfigMutex_attributes = {
  .name = "gGrowCycleConfigMutex",
  .cb_mem = &gGrowCycleConfigMutexControlBlock,
  .cb_size = sizeof(gGrowCycleConfigMutexControlBlock),
};
/* Definitions for gAutomaticMode */
osMutexId_t gAutomaticModeHandle;
osStaticMutexDef_t gAutomaticModeControlBlock;
const osMutexAttr_t gAutomaticMode_attributes = {
  .name = "gAutomaticMode",
  .cb_mem = &gAutomaticModeControlBlock,
  .cb_size = sizeof(gAutomaticModeControlBlock),
};
/* Definitions for gEepromMutex */
osMutexId_t gEepromMutexHandle;
osStaticMutexDef_t gEepromMutexControlBlock;
const osMutexAttr_t gEepromMutex_attributes = {
  .name = "gEepromMutex",
  .cb_mem = &gEepromMutexControlBlock,
  .cb_size = sizeof(gEepromMutexControlBlock),
};
/* Definitions for gLoggerMutex */
osMutexId_t gLoggerMutexHandle;
osStaticMutexDef_t gLoggerMutexControlBlock;
const osMutexAttr_t gLoggerMutex_attributes = {
  .name = "gLoggerMutex",
  .cb_mem = &gLoggerMutexControlBlock,
  .cb_size = sizeof(gLoggerMutexControlBlock),
};
/* Definitions for gConfigAvailableMutex */
osMutexId_t gConfigAvailableMutexHandle;
osStaticMutexDef_t gConfigAvailableMutexControlBlock;
const osMutexAttr_t gConfigAvailableMutex_attributes = {
  .name = "gConfigAvailableMutex",
  .cb_mem = &gConfigAvailableMutexControlBlock,
  .cb_size = sizeof(gConfigAvailableMutexControlBlock),
};
/* Definitions for gStartTimeMutex */
osMutexId_t gStartTimeMutexHandle;
osStaticMutexDef_t gStartTimeMutexControlBlock;
const osMutexAttr_t gStartTimeMutex_attributes = {
  .name = "gStartTimeMutex",
  .cb_mem = &gStartTimeMutexControlBlock,
  .cb_size = sizeof(gStartTimeMutexControlBlock),
};
/* Definitions for gMessagePoolMutex */
osMutexId_t gMessagePoolMutexHandle;
osStaticMutexDef_t gMessagePoolMutexControlBlock;
const osMutexAttr_t gMessagePoolMutex_attributes = {
  .name = "gMessagePoolMutex",
  .cb_mem = &gMessagePoolMutexControlBlock,
  .cb_size = sizeof(gMessagePoolMutexControlBlock),
};
/* Definitions for gHeartbeatMutex */
osMutexId_t gHeartbeatMutexHandle;
osStaticMutexDef_t gHeartbeatMutexControlBlock;
const osMutexAttr_t gHeartbeatMutex_attributes = {
  .name = "gHeartbeatMutex",
  .cb_mem = &gHeartbeatMutexControlBlock,
  .cb_size = sizeof(gHeartbeatMutexControlBlock),
};
/* Definitions for gControllerEventGroup */
osEventFlagsId_t gControllerEventGroupHandle;
osStaticEventGroupDef_t gControllerEventGroupControlBlock;
const osEventFlagsAttr_t gControllerEventGroup_attributes = {
  .name = "gControllerEventGroup",
  .cb_mem = &gControllerEventGroupControlBlock,
  .cb_size = sizeof(gControllerEventGroupControlBlock),
};
/* Definitions for INITIALIZATION_COMPLETE */
osEventFlagsId_t INITIALIZATION_COMPLETEHandle;
osStaticEventGroupDef_t INITIALIZATION_COMPLETEControlBlock;
const osEventFlagsAttr_t INITIALIZATION_COMPLETE_attributes = {
  .name = "INITIALIZATION_COMPLETE",
  .cb_mem = &INITIALIZATION_COMPLETEControlBlock,
  .cb_size = sizeof(INITIALIZATION_COMPLETEControlBlock),
};
/* USER CODE BEGIN PV */

// globale Variablen
ControllerState gControllerState;
GrowCycleConfig gGrowCycleConfig;
char uidStr[25];
bool automaticMode;
bool gConfigAvailable;
struct tm gStartTimeTm;
bool gTimeSynchronized;

bool manualMode = false;


// Heartbeat-Daten (definiert global)
TaskHeartbeat task_heartbeats[MAX_MONITORED_TASKS];


/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
static void MX_GPIO_Init(void);
static void MX_SPI1_Init(void);
static void MX_USART2_UART_Init(void);
static void MX_SPI2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM6_Init(void);
static void MX_TIM10_Init(void);
static void MX_I2C2_Init(void);
void StartAliveTask(void *argument);
void StartNetworkTask(void *argument);
void StartWaterControllerTask(void *argument);
void StartLightTask(void *argument);
void StartSensorTask(void *argument);
void StartHardwareTask(void *argument);

/* USER CODE BEGIN PFP */
void InitControllerState(void);
/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
// UID auslesen und anzeigen
void GetSTM32UID(char *uidStr) {
    uint32_t uid[3];
    uid[0] = *(uint32_t *)0x1FFF7A10;
    uid[1] = *(uint32_t *)0x1FFF7A14;
    uid[2] = *(uint32_t *)0x1FFF7A18;

    if (sprintf(uidStr, "%08lX%08lX%08lX", uid[0], uid[1], uid[2]) < 0) {
        LOG_INFO("main.c:\t - Error formatting UID string");
        return;
    }

    LOG_INFO("main.c:\t STM32 UID ausgelesen und gespeichert: %s", uidStr);

