SChristophS/GrowBox_NG/growbox-controller/STM32f4_GCU/Core/Src/main.c
}



/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_SPI1_Init();
  MX_USART2_UART_Init();
  MX_SPI2_Init();
  MX_TIM3_Init();
  MX_TIM6_Init();
  MX_TIM10_Init();
  MX_I2C2_Init();
  /* USER CODE BEGIN 2 */

  LOG_INFO("main.c:\t NextGeneration Growbox Project");



  resetAssert();
  HAL_Delay(300);
  resetDeassert();
  HAL_Delay(300);

  // Initialisieren des Nachrichtenpools und des zugehörigen Mutexes
  initialize_message_pool();




  // Initialisiere gControllerState
  gControllerState.wasserbeckenZustand = false;
  gControllerState.pumpeZulauf = false;
  gControllerState.pumpeAblauf = false;
  gControllerState.sensorOben = false;
  gControllerState.sensorUnten = false;
  gControllerState.lightIntensity = 0;
  gControllerState.automaticMode = false;


  GetSTM32UID(uidStr);



  /* USER CODE END 2 */

  /* Init scheduler */
  osKernelInitialize();
  /* Create the mutex(es) */
  /* creation of gControllerStateMutex */
  gControllerStateMutexHandle = osMutexNew(&gControllerStateMutex_attributes);

  /* creation of gGrowCycleConfigMutex */
  gGrowCycleConfigMutexHandle = osMutexNew(&gGrowCycleConfigMutex_attributes);

  /* creation of gAutomaticMode */
  gAutomaticModeHandle = osMutexNew(&gAutomaticMode_attributes);

  /* creation of gEepromMutex */
  gEepromMutexHandle = osMutexNew(&gEepromMutex_attributes);

  /* creation of gLoggerMutex */
  gLoggerMutexHandle = osMutexNew(&gLoggerMutex_attributes);

  /* creation of gConfigAvailableMutex */
  gConfigAvailableMutexHandle = osMutexNew(&gConfigAvailableMutex_attributes);

  /* creation of gStartTimeMutex */
  gStartTimeMutexHandle = osMutexNew(&gStartTimeMutex_attributes);

  /* creation of gMessagePoolMutex */
  gMessagePoolMutexHandle = osMutexNew(&gMessagePoolMutex_attributes);

  /* creation of gHeartbeatMutex */
  gHeartbeatMutexHandle = osMutexNew(&gHeartbeatMutex_attributes);

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

  /* Create the queue(s) */
  /* creation of xWaterControllerQueue */
  xWaterControllerQueueHandle = osMessageQueueNew (1, sizeof(uint8_t), &xWaterControllerQueue_attributes);

  /* creation of xLightControllerQueue */
  xLightControllerQueueHandle = osMessageQueueNew (1, sizeof(uint8_t), &xLightControllerQueue_attributes);

  /* Creation of xWebSocketQueue */
  xWebSocketQueueHandle = osMessageQueueNew (3, sizeof(MessageForWebSocket*), &xWebSocketQueue_attributes);

  /* creation of xHardwareQueue */
  xHardwareQueueHandle = osMessageQueueNew (2, 8, &xHardwareQueue_attributes);

  /* creation of xWaterCommandQueue */
  xWaterCommandQueueHandle = osMessageQueueNew (3, 4, &xWaterCommandQueue_attributes);

  /* creation of xLightCommandQueue */
  xLightCommandQueueHandle = osMessageQueueNew (3, 4, &xLightCommandQueue_attributes);

  /* USER CODE BEGIN RTOS_QUEUES */
  if (xWaterControllerQueueHandle == NULL) {
        printf("main.c:\t Error: Failed to create xWaterControllerQueue\r\n");
    }

  if (xLightControllerQueueHandle == NULL) {
      printf("main.c:\t Error: Failed to create xLightControllerQueue\r\n");
  }

  if (xHardwareQueueHandle == NULL) {
       printf("main.c:\t Error: Failed to create xAutoGrowQueue\r\n");
   }

  if (xWaterCommandQueueHandle == NULL) {
       printf("main.c:\t Error: Failed to create xWaterCommandQueue\r\n");
   }

  if (xLightCommandQueueHandle == NULL) {
       printf("main.c:\t Error: Failed to create xLightCommandQueue\r\n");
   }

  /* USER CODE END RTOS_QUEUES */

  /* Create the thread(s) */
  /* creation of AliveTask */
  AliveTaskHandle = osThreadNew(StartAliveTask, NULL, &AliveTask_attributes);

  /* creation of NetworkTask */
  NetworkTaskHandle = osThreadNew(StartNetworkTask, NULL, &NetworkTask_attributes);

  /* creation of WaterController */
  WaterControllerHandle = osThreadNew(StartWaterControllerTask, NULL, &WaterController_attributes);

  /* creation of LightTask */
  LightTaskHandle = osThreadNew(StartLightTask, NULL, &LightTask_attributes);

  /* creation of SensorTask */
  SensorTaskHandle = osThreadNew(StartSensorTask, NULL, &SensorTask_attributes);

  /* creation of HardwareTask */
  HardwareTaskHandle = osThreadNew(StartHardwareTask, NULL, &HardwareTask_attributes);

  /* USER CODE BEGIN RTOS_THREADS */
  /* add threads, ... */
  /* USER CODE END RTOS_THREADS */

  /* creation of gControllerEventGroup */
  gControllerEventGroupHandle = osEventFlagsNew(&gControllerEventGroup_attributes);

  /* creation of INITIALIZATION_COMPLETE */
  INITIALIZATION_COMPLETEHandle = osEventFlagsNew(&INITIALIZATION_COMPLETE_attributes);

  /* USER CODE BEGIN RTOS_EVENTS */

  LOG_INFO("main.c:\t - check if all Tasks are created correctly...");
  // check if all Tasks are created correctly
  if (AliveTaskHandle == NULL) {
	printf("main.c:\t - Error: Failed to create AliveTask\r\n");
    Error_Handler();
  }
   if (NetworkTaskHandle == NULL) {
	printf("main.c:\t - Error: Failed to create NetworkTaskHandle\r\n");
    Error_Handler();
  }

  if (WaterControllerHandle == NULL) {
	printf("main.c:\t - Error: Failed to create WaterControllerHandle\r\n");
    Error_Handler();
  }


  if (LightTaskHandle == NULL) {
	printf("main.c:\t - Error: Failed to create LightTaskHandle\r\n");
    Error_Handler();
  }

  if (SensorTaskHandle == NULL) {
	printf("main.c:\t - Error: Failed to create SensorTaskHandle\r\n");
    Error_Handler();
  }

  if (HardwareTaskHandle == NULL) {
	printf("main.c:\t - Error: Failed to create HardwareTaskHandle\r\n");
    Error_Handler();
  }

