SChristophS/GrowBox_NG/growbox-controller/STM32f4_GCU/Core/Src/main.c
  /*Configure GPIO pin : MEMS_INT2_Pin */
  GPIO_InitStruct.Pin = MEMS_INT2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_EVT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(MEMS_INT2_GPIO_Port, &GPIO_InitStruct);

/* USER CODE BEGIN MX_GPIO_Init_2 */
/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */

// Funktion zur Initialisierung der Heartbeat-Daten
void InitializeTaskHeartbeats(void) {
    osMutexAcquire(gHeartbeatMutexHandle, osWaitForever);
    for (int i = 0; i < MAX_MONITORED_TASKS; i++) {
        task_heartbeats[i].task_name = NULL;
        task_heartbeats[i].last_heartbeat = 0;
    }
    osMutexRelease(gHeartbeatMutexHandle);
}

// Funktion zur Registrierung einer Task
bool RegisterTaskHeartbeat(const char *task_name) {
    bool registered = false;
    osMutexAcquire(gHeartbeatMutexHandle, osWaitForever);
    for (int i = 0; i < MAX_MONITORED_TASKS; i++) {
        if (task_heartbeats[i].task_name == NULL) {
            task_heartbeats[i].task_name = task_name;
            task_heartbeats[i].last_heartbeat = HAL_GetTick();
            registered = true;
            break;
        }
    }
    osMutexRelease(gHeartbeatMutexHandle);
    return registered;
}

// Funktion zur Aktualisierung des Heartbeats einer Task
void UpdateTaskHeartbeat(const char *task_name) {
    osMutexAcquire(gHeartbeatMutexHandle, osWaitForever);
    for (int i = 0; i < MAX_MONITORED_TASKS; i++) {
        if (task_heartbeats[i].task_name != NULL && strcmp(task_heartbeats[i].task_name, task_name) == 0) {
            task_heartbeats[i].last_heartbeat = HAL_GetTick();
            break;
        }
    }
    osMutexRelease(gHeartbeatMutexHandle);
}
/* USER CODE END 4 */

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM1 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM1) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
